# -*- encoding: utf-8 -*-
import sys
from os import linesep

HANJA_START = u'\u4E00'
HANJA_END = u'\u9FFF'

COMMON_HANJA = (
("不吉", "불길"),
("中毒", "중독"),
("中美", "중미"),
("交換", "교환"),
("人", "인"),
("仲裁", "중재"),
("低所得層", "저소득층"),
("使料", "사료"),
("保護鳥", "보호조"),
("傘下機關", "산하기관"),
("國境", "국경"),
("大", "대"),
("對立", "대립"),
("州", "주"),
("市", "시"),
("引下", "인하"),
("感動", "감동"),
("故", "고"),
("救護活動", "구호활동"),
("最高記錄", "최고기록"),
("未成年者", "미성년자"),
("檢査", "검사"),
("流産", "유선"),
("流行", "유행"),
("淸凉飮料", "청량음료"),
("溫突", "온돌"),
("熱帶雨林", "열대우림"),
("物品稅", "물품세"),
("百年佳約", "백년가약"),
("監禁", "감금"),
("確率", "확률"),
("社", "사료"),
("祝賀", "축하"),
("紙", "지"),
("絶頂", "절정"),
("美", "미"),
("自立", "자립"),
("落島", "낙도"),
("行", "행"),
("街", "가"),
("規律", "규율"),
("誌", "지"),
("謹愼", "근신"),
("路", "로"),
("退職金", "퇴직금"),
("通過儀禮", "통과의례"),
("遵守", "준수"),
("銅", "동"),
("間", "간"),
("非", "비"),
("革新", "혁신"),
("韓流", "한류"),
("類推", "유추"),
("風力發電", "풍력발전"),
("風景", "풍경"),
("高設式", "고설식"),
)

if __name__=="__main__":
    for line in sys.stdin:
        for hanja, hangul in COMMON_HANJA:
            line = line.replace(hanja, hangul)
        uline = line.decode("utf-8")
        for ch in uline:
            if HANJA_START <= ch <= HANJA_END:
                sys.stderr.write(ch.encode("utf-8"))
            else:
                sys.stderr.write(".")
        sys.stderr.write(linesep)
        sys.stdout.write(line)
